Tekla.Structures.Geometry3d.LineSegment
The LineSegment class represents a single finite segment of a line in 3D space. See Line
for the implementation of a straight line.

Tekla.Structures.Geometry3d.LineSegment.Point1
Gets the start point of the line segment

Tekla.Structures.Geometry3d.LineSegment.Point2
Gets the end point of the line segment

Tekla.Structures.Geometry3d.LineSegment.StartPoint
Gets the start point of the line segment

Tekla.Structures.Geometry3d.LineSegment.EndPoint
Gets the end point of the line segment

Tekla.Structures.Geometry3d.LineSegment.Tekla#Structures#Geometry3d#ICurve#Length
Gets the

Tekla.Structures.Geometry3d.LineSegment.Clone
Creates a copy of itself
Returns: The copy

Tekla.Structures.Geometry3d.LineSegment.#ctor
Instantiates a line segment with both the starting point and the end point zeroed.

Tekla.Structures.Geometry3d.LineSegment.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Instantiates a line segment with the given points.
Point1: The starting point to be used.
Point2: The end point to be used.

Tekla.Structures.Geometry3d.LineSegment.Equals(System.Object)
Returns true if the objects are equal.
o: The object that equality is wished to be checked with.
Returns: True if the objects are equal.

Tekla.Structures.Geometry3d.LineSegment.Equals(Tekla.Structures.Geometry3d.ICurve)
Returns true if the other curve is a line segment equal to this
other: The curve to check equality against
Returns: True if the curves are equal

Tekla.Structures.Geometry3d.LineSegment.Length
Returns the length of a line segment.
Returns: The length of the line segment.

Tekla.Structures.Geometry3d.LineSegment.GetDirectionVector
Returns a new unit direction vector of a line segment.
Returns: The unit direction vector of the line segment.

Tekla.Structures.Geometry3d.LineSegment.GetHashCode
Returns a hash code for a line segment.
Notice, in extremely rare cases, you might not get the same
hash code for two line segments even though they are considered equal! This
should, however, happen only in extremely rare cases!
Returns: The hash code for the line segment.

Tekla.Structures.Geometry3d.LineSegment.op_Equality(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Checks the equality of two line segments.
Segment1: The first line segment to be used.
Segment2: The second line segment to be used.
Returns: True if the two line segments are equal.
False otherwise.

Tekla.Structures.Geometry3d.LineSegment.op_Inequality(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Checks the inequality of two line segments.
Segment1: The first line segment to be used.
Segment2: The second line segment to be used.
Returns: True if the two line segments are not equal.
False otherwise.